# Terminal
cask "ghostty"

# Editor
brew "neovim"
cask "cursor"

# Shell tools
brew "fzf"
brew "gh"
brew "ghq"
brew "starship"
brew "tmux"

# Modern CLI replacements
brew "eza"       # ls
brew "bat"       # cat
brew "fd"        # find
brew "ripgrep"   # grep
brew "zoxide"    # cd

# Languages
brew "go"
brew "n"          # Node.js version manager

# Container
cask "docker"     # Docker Desktop

# Utilities
brew "jq"
brew "lazygit"
brew "git-delta" # git diff pager
